sample_app/app/controllers/todolists_controller.rb

  def edit
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    # １. データを新規登録するためのインスタンス作成
    list = List.new(list_params)
    # ２. データをデータベースに保存するためのsaveメソッド実行
    list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "railsの勉強"], ["body", "投稿機能を作る！"], ["created_at", "2020-12-26 09:02:13.622386"], ["updated_at", "2020-12-26 09:02:13.622386"]]

  def update
    list = List.find(params[:id])
    list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "railsの勉強"], ["body", "投稿機能を作る\r\n"], ["updated_at", "2020-12-26 13:33:11.163038"], ["id", 1]]